
#include "stdafx.h"

#include <iostream>
//getch()함수
#include<conio.h>
#include <windows.h>

using namespace std;
//방향키 아스키코드 숫자 별명 정의
#define LEFT 75                       
#define RIGHT 77
#define UP 72
#define DOWN 80

//결과 저장 변수
int gram, leftbbang, turnsu;

// 내 위치 정보를 보관할 구조체.
typedef struct _myPos
{
	int Px;
	int Py;
} myPos;

// 번호 선택을 위한 구조체.
typedef struct _gamenum
{
	char num;
	int gram;
	int leftbbang;
	int turnsu;
	
} gamenum;

// 게임 시작화면1
int start_1()
{
	gamenum su;

	cout<<"                                                                               \n";
	cout<<"                                                        제작회사 : ㈜BNItech   \n";
	cout<<"                                                        제 작 자 : 임동빈      \n";
	cout<<"                                                                               \n";
	cout<<"       ┏━━━━┓    ┃   ┃          ┃   ┏━━━┓     ┏━━━┓         \n";
	cout<<"       ┃        ┃    ┃   ┃          ┃   ┃       ┃    ┃       ┃        \n";
	cout<<"       ┃        ┃━━┫   ┣━━━━━┫   ┃        ┃   ┃        ┃       \n";
	cout<<"       ┃        ┃    ┃   ┃          ┃   ┃         ┃  ┃       ┃        \n";
	cout<<"       ┗━━━━┛    ┃   ┃          ┃   ┃         ┃  ┣━━━┫         \n";
	cout<<"                            ┗━━━━━┛   ┃         ┃  ┃       ┃        \n";
	cout<<"         ━━━━━━━┓         ┃         ┃        ┃   ┃        ┃       \n";
	cout<<"                       ┃         ┃         ┃       ┃    ┃       ┃        \n";
	cout<<"                       ┃   ━━━┻━━━   ┗━━━┛     ┗━━━┛         \n";
	cout<<"                                                                               \n";
	cout<<"                                                                               \n";
	cout<<"                                                                               \n";
	cout<<"                                                                               \n";
	cout<<"                                                                               \n";
	cout<<"                                                                               \n";
	cout<<"            당신은 도전 할 준비가 되어있나?                                    \n";
	cout<<"                                                                               \n";
	cout<<"            1. 네, 도전 하겠습니다.                                            \n";
	cout<<"            2. 아니요, 저는 두렵습니다.                                        \n";
	cout<<"                                                                               \n";
	cout<<"            번호를 입력 하시오.";
	su.num = getch();
	cout<<"                                                                               \n";
	cout<<"                                                                               \n";
	return su.num;
}

//게임 시작화면2
int start_2()
{
	gamenum su;

	cout<<"                                                                               \n";
	cout<<"                                                        제작회사 : ㈜BNItech   \n";
	cout<<"                                                        제 작 자 : 임동빈      \n";
	cout<<"                                                                               \n";
	cout<<"       ┏━━━━┓    ┃   ┃          ┃   ┏━━━┓     ┏━━━┓         \n";
	cout<<"       ┃        ┃    ┃   ┃          ┃   ┃       ┃    ┃       ┃        \n";
	cout<<"       ┃        ┃━━┫   ┣━━━━━┫   ┃        ┃   ┃        ┃       \n";
	cout<<"       ┃        ┃    ┃   ┃          ┃   ┃         ┃  ┃       ┃        \n";
	cout<<"       ┗━━━━┛    ┃   ┃          ┃   ┃         ┃  ┣━━━┫         \n";
	cout<<"                            ┗━━━━━┛   ┃         ┃  ┃       ┃        \n";
	cout<<"         ━━━━━━━┓         ┃         ┃        ┃   ┃        ┃       \n";
	cout<<"                       ┃         ┃         ┃       ┃    ┃       ┃        \n";
	cout<<"                       ┃   ━━━┻━━━   ┗━━━┛     ┗━━━┛         \n";
	cout<<"                                                                               \n";
	cout<<"                                                                               \n";
	cout<<"                                                                               \n";
	cout<<"                                                                               \n";
	cout<<"                                                                               \n";
	cout<<"                                                                               \n";
	cout<<"            좋아! 그럼 어떤 단계에 도전하고 싶은가?                            \n";
	cout<<"                                                                               \n";
	cout<<"         ┌──────────────────────┐                      \n";
	cout<<"         │0단계. 무개념           (5단계. 인기남)     │                      \n";
	cout<<"         │(1단계. 허졉)           (6단계. 엄친아)     │                      \n";
	cout<<"         │(2단계. 초딩)           (7단계. 천재)       │                      \n";
	cout<<"         │(3단계. 민폐남)         (8단계. 마스터)     │                      \n";
	cout<<"         │(4단계. 평범남)         (9단계. 킹왕짱)     │                      \n";
	cout<<"         └──────────────────────┘                      \n";
	cout<<"          (아직 준비 중 입니다.)                                               \n";
	cout<<"                                                                               \n";
	cout<<"            단계에 해당하는 번호를 입력 하시오.";
	su.num = getch();
	cout<<"                                                                               \n";
	cout<<"                                                                               \n";
	return su.num;
}

//게임 승리 화면
int victory_1()
{
	gamenum su;
	cout<<"                                                                               \n";
	cout<<"                                                                               \n";
	cout<<"       ┌───────────────────────────┐              \n";
	cout<<"          \t"<<turnsu<<" 턴\t\t\t몸무게 "<<gram<<" g  \n";
	cout<<"       └───────────────────────────┘              \n";
	cout<<"                                                                               \n";
	cout<<"                                                                               \n";
	cout<<"                                                                               \n";
	cout<<"       ┃        ┃  ━┳━  ┏━━━┓  ━━┳━━                            \n";
	cout<<"        ┃      ┃     ┃    ┃      ┃      ┃                                \n";
	cout<<"         ┃    ┃      ┃    ┃              ┃                                \n";
	cout<<"          ┃  ┃       ┃    ┃      ┃      ┃                                \n";
	cout<<"           ┗┛      ━┻━  ┗━━━┛      ┃                                \n";
	cout<<"                                                                               \n";
	cout<<"                                        ┏━━┓    ┏━━━┓   ┃    ┃      \n";
	cout<<"                                       ┃      ┃   ┃       ┃   ┃  ┃       \n";
	cout<<"                                      ┃        ┃  ┣━━┳┛      ┳         \n";
	cout<<"                                       ┃      ┃   ┃     ┃       ┃         \n";
	cout<<"                                        ┗━━┛    ┃      ┃      ┃         \n";
	cout<<"                                                                               \n";
	cout<<"                                                                               \n";
	cout<<"                                                                               \n";
	cout<<"                                                                               \n";
	cout<<"             추카추카~! 대단한 실력이군... 어떻게 할텐가                       \n";
	cout<<"                                                                               \n";
	cout<<"            1. 다시 한번 더 도전해 보고 싶습니다.                              \n";
	cout<<"            2. 게임을 그만 하겠습니다.                                         \n";
	cout<<"                                                                               \n";
	cout<<"            번호를 입력 하시오.";
	su.num = getch();
	cout<<"                                                                               \n";
	cout<<"                                                                               \n";
	return su.num;
}

char map_0[35][35] = 
{
 {1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {1,3,1,3,1,1,3,1,3,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {1,3,1,3,3,3,3,1,3,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {1,3,1,3,1,1,3,3,3,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {1,3,1,3,3,3,3,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {1,3,1,1,1,1,3,3,3,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {1,3,3,3,3,3,3,1,3,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {1,3,1,1,3,1,3,1,3,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {1,3,1,3,3,1,3,1,3,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {1,2,1,3,1,3,3,1,3,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
 {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
};


// 해당 위치로 커서를 이동시키는 함수
void gotoxy(int x, int y) 
{
	COORD pos = {x, y};
	SetConsoleCursorPosition(GetStdHandle(STD_OUTPUT_HANDLE), pos);
}

// 화면을 지우고 커서 위치를 0, 0위치로 이동시키는 함수
void clrscr(void)
{ 
	COORD Cur= {0, 0};
	unsigned long dwLen;
	FillConsoleOutputCharacter(GetStdHandle(STD_OUTPUT_HANDLE) , '  ', 100*25, Cur, &dwLen);
}

// 게임 판을 그리는 함수
void DrawBoard(char map_0[35][35])
{
	int i, j; 
	
	// 배열 내용을 확인하고 화면을 그리는 반복문.
	for(i = 0; i < 35; i++)
	{
		for(j = 0; j < 35; j++)
		{
			switch(map_0[i][j])
			{
				//1 : 벽
				case 1:
					cout <<"▩";
					break;
				//2 : 캐릭터
				case 2:
					cout <<"㏈";
					break;
				//3 : 빵
				case 3:
					cout <<"Θ";
					break;
				default :
					cout <<"  ";
					break;
			}
	
		}
		cout << "\n";
	}
}

// 현재 남은 빵의 개수를 세는 함수
int bbang(char map_0[35][35])
{
	int i,j,cnt=0;

	for(i=1; i<34; i++)
	{
		for(j=1; j<34; j++)
		{
			if(map_0[i][j]==3)
				cnt++;
		}
	}
	return cnt;
}

//나의 초기 설정하는 함수
void na_index(int *Px,int *Py)
{
	int i, j;
	for(i=1; i<34; i++)
	{
		for(j=1; j<34; j++)
		{
			if(map_0[i][j]==2)
			{
				*Px=i;
				*Py=j;
			}
		}
	}
}

//시작화면 처리 하는 함수
void start()
{
	char num;

	while(1)
	{
		num = start_1();
		if(num=='1')
		{

		clrscr();
		gotoxy(0, 0);

		num = start_2();
		if(num=='0' || num=='1' || num=='2' || num=='3' || num=='4' || num=='5' || num=='6' || num=='7' || num=='8' || num=='9')
		break;
	
		}
		else if (num=='2')
			exit(0);

		clrscr();
		gotoxy(0, 0);
	}
}
//종료 화면 처리 함수 
void end()
{
	int num;

	while(1)
	{
		num=victory_1();
		if(num=='1')
		{
			clrscr();
			gotoxy(0, 0);
			start();
		}

		else if (num=='2')
			exit(0);

		clrscr();
		gotoxy(0, 0);
	}

}

// 캐릭터 이동 함수
void na_move(int *Px,int *Py)
{
	int ui;
		ui = getch();                  

		// 사용자 입력 구분
		switch(ui)
		{
			case UP:
				//벽 통과 방지 조건.------
				if(map_0[(*Px)-1][*Py]==1)
					break;
				//-------------------------
				map_0[*Px][*Py] = 0;
				(*Px)--;
				break;
			case RIGHT:
				if(map_0[*Px][(*Py)+1]==1)
					break;
				map_0[*Px][*Py] = 0;
				(*Py)++;
				break;
			case DOWN:
				if(map_0[(*Px)+1][*Py]==1)
					break;
				map_0[*Px][*Py] = 0;
				(*Px)++;
				break;
			case LEFT:
				if(map_0[*Px][(*Py)-1]==1)
					break;
				map_0[*Px][*Py] = 0;
				(*Py)--;
				break;
			case 'p':
				exit(0); break;
		}
}

// 메인함수 
int main(int argc, char* argv[])
{
	int allbbang, cntview=0;
	myPos na;
	gamenum su;
	su.gram=0;

	//시작화면 처리 함수
	start();
	clrscr();
	gotoxy(0, 0);

	// 나의 초기 위치 설정
	na_index(&na.Px,&na.Py);

	//전체 빵의 갯수
	allbbang=bbang(map_0);

	cout <<"\n 남은 빵의 개수 = "<<allbbang<<" 개 \tDB의 몸무게 = 0 g";
	cout <<"\n 먹은 빵의 개수 = 0 개 \t\t과식맨 변신 = off\n\n";

	while(1)
	{	
		//화면 반복 횟수
		cntview++;

		//게임 턴수
		su.turnsu=cntview/2;

		// 보드를 그리고 사용자의 입력 대기
		DrawBoard(map_0);

		cout <<"[p 누르면 강제 종료 됩니다.]";
		cout <<"\n[방향키를 눌러 캐릭터를 이동하세요. "<<su.turnsu<<"턴 ]\n";

		// 캐릭터 이동 함수
		na_move(&na.Px, &na.Py);

		map_0[na.Px][na.Py] = 2;
		clrscr();
		gotoxy(0, 0);

		//남은빵의 개수
		su.leftbbang=bbang(map_0);

		//몸무게 계산
		su.gram=(allbbang-su.leftbbang)*5;

		//빵을 다 먹으면 종료화면 띄운다
		if(su.leftbbang==0)
		{
			gram = su.gram;
			leftbbang= su.leftbbang;
			turnsu = su.turnsu;
			end();
		}

		cout <<"\n 전체 빵의 개수 = "<<allbbang<<" 개 \tDB의 몸무게 = "<<su.gram<<" g";
		cout <<"\n 먹은 빵의 개수 = "<<allbbang-su.leftbbang<<" 개  \t과식맨 변신 = off\n\n";
	}
	
	return 0;
}
//gettimeofday
// cin
// gettimeofday
// 시간빼기 시간111111111111